This video is brought to you by Corsair,|Thor, the god of thunder, strength,|lightning, and throwing your party|members. Well, maybe not quite the last|one, but we're going to combine all|these elements into a fun multiclass|today. Taking the new giant barb and|mixing it with fighter, we'll end up|with a thunder and lightning focused|monster that throws weapons, chucks|party members, and slams the ground with|thunderous fury. Now, I've done this|build before, but this is an updated|version where I focus more on the|barbarian levels and the new barbarian|subclass. If this is your first time on|my channel, the way I do things is by|uploading the knowledge of my videos.|So, with that being said, this build is|very straightforward. You'll be taking|10 levels of giant barb and then finally|two levels of fighter to give us action|surge. That'll unlock an additional|action for us to do some serious damage.|In my builds, I typically don't favor|heavy elixir play, but I wanted to|showcase how disgusting Tavern Brawler|can be in this build. So, I'll be using|the feat tavern brawler, then using|elixirs of hill or cloud giant strength,|depending on where you're at in the|game. Honestly, this is a pretty cookie|cutter giant barb. The real unique|elements are the items that we'll be|taking. So, you can find all this|information linked in the written build|guide below. But if that's all you|wanted to know, please feel free to shut|the video down. As always, I want to be|respectful of your time. You can jump to|any part of the video that interests you|the most using the chapters with the|timeline in the description. before you|head out if you find the information in|this video helpful. Though, please don't|forget to like, comment, or subscribe,|as each one of those things helps me out|in a huge way. Also, take a look at my|Twitch linked in the comment and|description where I'll be streaming my|pure evil run using this build and|plenty of other ones. Let's get started|here on my Carlac God of Thunder build|in Balderskate 3. And just as a heads|up, the next 2 minutes and 14 seconds|will be an advertisement now for|Corsair. So, I just built out a brand|new computer in prep for a lot of the|more graphic intensive launches coming|like Doom, Dune, GTA, and what have you.|And Corsera was kind enough to send me a|Titan IQ Link 360 RX Liquid Cooling|AIO. Big breath of air there. I've been|building computers since I was like in|my teens, and Corsair, for me|personally, has always been a stamp of|excellence. And usually, you watch these|ads and it was something that was sent|unprompted. Nay, I told Corsair what I|was building cuz I talked to them at|TwitchCon and they were happy to work|alongside me to help me build my brand|new spaceship. Having come from the|Corsair IQ H150i LCD, I was already|playing around with an CPU cooler with a|LCD screen on it. But the Titan 360|comes with an even better LCD screen|that has LEDs in the cap, allowing for a|ton of lighting customization. I can see|system temps, images, or even animated|GIFs if you want to have some fun and be|cheeky. What I really like here is the|flow drive cooling engine with|three-phase motor. And that's like the|most marketing thing ever. But what does|that mean? Well, Corsair has built a|proprietary pump, whereas most companies|just kind of piece this out from a lot|of other companies. But that pump no|longer has the distinctive hum that|comes with most closed loop AIO's.|Truly, what I hear now is the three high|performance RX120 fans, hence the name|360RX that come with the cooler and the|bevy of the other Corsair fans in the|monster that I have before me. Since I|also swapped from Intel, the Corsair|Titan affords compatibility across both|Intel socket LGA1 1851 and AMD AM5,|which is a standard they've always held,|but was one I wanted to ensure was|present. Lastly, I want my computer to|look like it's ready for a laser light|show at Excess nightclub with Tiestto|headlining. So, with 44 individually|addressable RGB LEDs on the pump and|cap, like I talked about before, the|only thing missing is CO2 explosions|coming out of the side of this computer|as I'm rolling through a good time.|Again, a huge shout out and thank you to|Corsair for providing me with this|behemoth of an AIO. If you're in the|market to pick one up, you can find a|link in my description or one should pop|up in the corner directing you to the|Titan. But with that being said, let's|get started on our video. Loading into|the character creation screen. Let's|have some fun. Now, remember this is a|single player narrative game, so please|choose any race that makes sense for you|and the RP you have in mind for this|character. Now, while I have discussed|this being a Carlac build, we're going|to show it as a build that you can use|for your main character or for her.|After this point in the video, I'll just|be showing it from Carlac's perspective,|but the races I actually do enjoy for|this are the Tlings. Um, I like pretty|much any race for a barbarian that gets|them resistance to a damage type. So, in|this case, we're going to get resistance|to fire damage. Um, but another real|good one here is the dwarfs because|dwarfs are going to give you resistance|to poison. Specifically though, the|dwagar. The dwgar will get their own|version of enlarge that you can use as|well. and they also get an advantage on|being charmed or paralyzed. It's one of|the best races in the game in my|opinion, especially too for this uh|specific build. The Drow are always|cool. Um Githar are fun because I like|this ability here for astral knowledge.|So if you're this is your main|character, what's cool about this is you|can use astral knowledge to get profic|proficiency in all skills of a chosen|ability. So for example, the|conversational skills are all of the|charisma ability. and we're not really|focusing on that. We're barbarian,|right? So, you can use astral knowledge|to give you a proficiency in them to|help push through a challenging|discussion point. What I will say though|is it is challenging to throw things as|a smaller character. So, if you're like|a small race, even like a halfling,|which is great, you know, using lucky,|it's going to be harder for you to throw|stuff. even dwarfs which are not um|they're not necessarily a small race. Uh|they they are a little bit larger than|the other ones but um the smaller ones|like halfling and gnome um when you use|your giant barb it's going to increase|your size. So, the larger races like|Tling, human, half orc, dragon born,|elf, drow, uh, gith, half elf, they'll|all be able to throw things even, uh,|uh, um, I guess you can say not larger|things, but yeah. Yeah, larger things|because they themselves will be larger|as a result of a giant barb. So, just|know that like I wouldn't jump into a|gnome or a halfling, for example,|because of that limitation. Um, you can|see here ra r ra r ra r ra r ra r ra r|ra r ra r ra r ra ratial speed there is|uh 25 versus this being 30 because of|their size. Um, so just know those|things. Again, tiffing though stand out.|I I always do like dragon born because|using breath attacks is fun. You can use|a specific weapon that it goes alongside|it. But halfworks are also fun because|they do get their critical hits with|melee weapon attacks. We will be|throwing things. Um, so this doesn't|really trigger, but you do get|relentless endurance. So if you get|knocked down to zero hit points, you|come back with one hit point. So always|great to see those things. Uh, Telings|though, I would go Zaryel Teling by the|way because the Zariel Telling cantrips,|they scale off of constitution versus|these two will scale off of charisma.|So, I would just recommend that. It's|also my favorite Teling. Now, into|class, we're going to, of course, go|with barbarian. This is going to give us|an armored defense, which is nice. Here,|while not wearing armor, you get add|your constitution modifier to your armor|class. And we're going to have a ton of|constitution here to really play around|with. for our background. Please choose|one that fits the roleplay of your|character. If you're not going with|Carlac, as always, just choose something|that kind of fits, right? Create the RP|because your background is how you're|going to get inspirations, and|inspirations are going to allow you to|reroll um hard conversational things you|might have missed, any big roles you|could otherwise can't roll. So, maybe|you're an outlander who this whole time|has been a barbarian and you've been|living off the land. Maybe you're a a|is ass is ass is ass is ass is ass is|ass is ass is ass is assued their royal|or maybe even noble blood to live in the|wildlands of the of the barbarians|lifestyle. Maybe you are a former|soldier who's so riddled with PTSD all|you do is warm wander the fields as|barbarian screaming at rocks and|punching bears. Who knows what it is?|You have any number of things. My|typical minmax uh selection though, if|you don't want to if you just want to|like, hey, just give me one to choose|guy is guild artisan because I always|like having specialization and insight|and persuasion. It does help with a lot|of conversational things. When it comes|to your skills, you'll choose skills|that make sense for your character, the|roleplay you have in mind, and what have|you. If it's your face character, I|always recommend choosing one of the|conversational skills. And intimidation|for barbarians is quite cool because|there's a lot of really fun um barbarian|themed uh dialogue options that are also|intimidation options. So if you've never|gone with intimidation for a uh not a|voice skill um a conversational skill, I|definitely recommend it. Also, another|very important one is athletics. I don't|usually recommend athletics. Um, but|this is important for one of the|barbarians abilities because their|ability to to kick things is based off|of their athletic skill. So, make sure|you have this. You'll probably have it|uh if you're playing Carlac, she just|gets it natively, but depending on your|your background will determine whether|or not athletics has been triggered.|Just make sure you have a proficiency|point in it so you can help out with|those kicks. Let's take a look now at|those ability points. So, when it comes|to our ability points, we have two ways|of approaching this. If you're|comfortable with elixirs and you like to|minmax that game play, you can|definitely go about that with minimal|strength focusing on decks and|constitution. I'm going to assume that|you maybe are not the best with elixirs|or you don't want to rely on a specific|elixir. So, I'm going to build out this|character with a lot of strength. It's|worth noting that this character is|going to be so strong regardless of|whether or not you choose elixirs that|elixirs just makes it really, really,|really foul. So, I'll I'll talk about|that in a separate section, but we're|going to put all of our points right|here into strength with a plus two. When|we choose Tavern Brawler, we'll put it|into strength, and that's going to set|it to 18. Um, then our constitution, we|want as high as it can go with a plus|one. That's going to make it 16. We're|going to put two points into wisdom.|This is going to help us deflect any|kind of charm or impairing effects onto|the character. And then we're going to|put the rest of the points into|dexterity. Dexterity is going to give us|initiative. It's going to give us armor|class, but remember, we are a barbarian,|right? So, we're also going to pull more|armor class from our constitution as|well. So, we're going to get the plus|two plus the plus three into our AC when|we're not wearing armor as a barbarian.|So, this is the build if you are going|um really without worrying about|strength elixir. If you wanted to focus|on strength elixir, you'd probably bring|this back down to 10 and do like|something like that, you know, and then|just kind of dump it here into probably|something like something like this. If I|was going to use strength elixirs, but|if you're not worried about that, you|don't know what I'm talking about, then|just just do what I said before and|you'll be just fine. Let's go ahead and|bring myself back to that if I can|remember how to read or write. There we|go. Uh, there we go. Perfect. Yeah. So,|that's our stats here for this|character. Let's jump into the leveling.|Leveling up, as I said before, is very|straightforward. We'll jump into level|two. That's going to give us our class|action of danger sense, which is|advantage on deck saving throws against|trapped spells and services. And we'll|get reckless attack. Jumping into level|three, that's going to give us our um|subass. Now, the typical old school of|throwing barb was using berserker|because berserker got enraged throw,|which was a bonus action. It's still a|great route and you could go with that|with this build and be just fine. But|we're going to focus on the patch 8|subasses going with giant. Giant's going|to give us a vabra greed which increases|our carry capacity by a quarter. If|you're a human, this increases your|carry capacity by a total of a half|because a human gets a quarter plus this|gets us a quarter. So, it's nice. Now,|we get our special giants rage here,|which is going to increase our size and|your rage damage bonus is doubled on|throw attacks. It's it's it's going to|really not be good here, guys. It's|going to be really disgusting as far as|that amount of damage that's coming out|of you between this and Tavern Brawler.|So, just hold on to your butts as the|famous Samuel Jackson would say. So,|that's our setup for level three into|level four. We get nothing except for|our feet. Let's go into our options for|feats. Now, the biggest thing we need|here, the first thing we need here is|Tavern Brawler. It's going to be right|here, and we're going to get plus one|point to one of these two abilities. So,|we've gone with strength. This is why|this is nice for Carlac, right? Cuz|usually when you're playing the game,|uh, your main character is going to get|the hag's hair. And if you've never|played, you'll not know what that means,|so don't worry about it. It wasn't a|spoiler. So, this allows us to get our|strength up to 18, which is good because|remember, Tavern Brother is going to|double this. When you make an unarmed|attack, use an improvised weapon or|throw something. Your strength modifier|is uh is added twice to the damage and|attack rolls. It's also doing that|because of our rage. So, like I said,|it's going to be not good. It's gonna|And I don't we're I don't know if it|goes double then double, but I'm pretty|sure it's separate damage instances. So,|they they get doubled individually, not|as a like, okay, it doesn't double our|strength modifier, then double that. So,|I'm saying it doesn't do uh 16. Well,|either way, I'll explain that more in|the combat section. But um when it comes|to our other feed choices, ability|improvement I quite like because I want|to bring my strength up to a native 20.|Ability improvement can only work up to|20. Right? It says you increase ability|by two or two abilities by one to a max|of 20. Another good option here is|alert. That's a really famous one, but|barbarian has alert built into its kit.|So I'm actually not interested in that.|The only difference is that barbarians|alert is a plus three bonus versus the|versus the plus five bonus. Uh, but I|think really the two that we're going to|focus on here are ability improvement|because we're going to focus on strength|and also uh, Tavern Brawler, and we're|only going to get two perks in this|build. So, we're going to start with|Tavern Brawler first and then take|ability score improvement later in the|build. Now, on to level five, we get|access to our extra attack, which is|meaning we're going to be able to throw|twice per primary action. We're also|going to get access here to fast|movement. So, 10 feet increased movement|speed while not wearing heavy armor.|Remember, we talked about athletics.|Well, now boot of the giants is going to|come in. Try to kick a target away. Your|chances depend on your athletics and are|higher if you're hidden or invisible. We|won't be doing either of the latter two,|but we will be kicking stuff if it gets|close to us. And it's a bonus action.|So, it's a cool way to clear things out|rather than just pressing shove cuz you|will do damage to them. That's the|important thing there. So, after level|five, we'll go ahead and move forward|here into level six. We'll get another|um little guy here, but this is a real|important one. Elemental Cleaver.|Channel primordial might into your|weapon. Until the end of your rage, your|weapon will deal additional acid, cold,|fire, lightning, or thunder damage and|will gain the throne property. If|thrown, it will immediately reappear in|your hand. This is the most important|skill of the entire build right now|because after this, you could you could|jump into a different subclass if you|wanted and completely go off the rails|from this video. In fact, I encourage|it. Um, but this is important for two|reasons. Um, one, well, three reasons.|one, the thing the the weapon you throw|will reappear in your hand. Usually,|you'd have to do something like go into|Eldrich Knight or have a camp follow to|Eldrich Knight to bond something. You|don't have to worry about that. Now,|secondly, we can now have things do|either thunder or lightning damage. Both|will play into the way that we're|playing this build. Thunder damage being|primarily the one we want to focus on.|And lastly, the throne property. So, why|this is important? It means that every|single weapon in the game is now viable|for this build. Prior to this, you would|have to use something that had the|throne property. The throne property is|important because what this means is|when thrown, these weapons deal the same|damage they would for a melee attack. If|it doesn't have the throne property, so|for example, the Baluran giant slayer|that does not have thrown, it will use|the weapon's weight as the consideration|for the damage. This now makes it so you|can throw the Baldder and Giant Slayer|as a two-handed weapon and it will do|its damage to the target. that is|insanely strong and it allows us to|pretty much play with whatever weapon we|want for this build and it really makes|for some fun um additional things. And|again, we're going to be adding thunder|damage or lightning damage to stuff to|play in with plenty of other items. So,|that's a big one that we're going to be|choosing. Into level seven here, we're|going to get our diet um alert. So,|feral instinct, you gain three bonus to|initiative and can't be|surprised. Into eight, we're also going|to get a new feat. Like I said, we're|going to go ability improvement and put|it into strength. Uh you can choose|whatever else you want in this location.|Like I said, you can use alert. It will|stack with the previous one, so you'd|have plus eight bonus initiative, but|since we already have it and we have a|decent amount of dexterity, I'm not too|worried about it. You're already going|to be just so strong. Uh level nine, we|get our brutal criticals. When you land|a critical hit, you roll an extra damage|of die as well as the normal additional|critical die. So, you just do way more|damage with your crits. And then further|into level 10 where our last barbarian|level occurs, we get mighty impel. This|is a bonus action. You can now throw|throw a creature or object that is|medium-sized or smaller. Majority of|things you fight in the game are|medium-sized or smaller at least. So,|it's easy for your character, which is|going to be larger than mediumsiz, to|throw things all over the place. Heavier|creatures and objects deal more damage|on impact. So, if you were to throw|something that was small or tiny, you|would do less damage than something that|was medium. So, that's what it's time to|say here. So, we'll take this level.|We'll go into our 11th character level|and switch over to fighter. Now, the|reason I'm going with fighter is because|it's going to unlock action surge. You|could go with two levels into anything.|There's not really a lot of stuff that|really plays here. If we went nine|instead of 10, we would probably go with|something like rogue to get unlock|additional bonus actions. But because|mighty impel comes at level 10 for|barbarian, this just gives us the|highest chance to succeed in whatever we|do. Now, for our fighting style, you can|go uh defense if you chose to wear|armor. My build is not wearing armor. Um|you can go with great weapon fighting.|When you roll a one or two or damage die|for an attack with a two-handed melee|weapon, that die is rerolled once. So,|I'm just going to go ahead and go with|that. Um, I haven't been able to test if|this actually works with throwing, but|it gives me the ability to use that|weapon in close combat a little bit|easier. So, that is your option there.|Um, you can also go two weapon fighting|if you want to start chucking stuff like|that, but it's it's entirely up to you.|And our last skill or level here goes|into fighter to also give us action|surge. We're also going to have a|disgusting amount of hit points because|remember the amount of hit points you|get per level as a barbarian is the|highest of any class, followed then by|fighter. well, fighter and a number of|other ones, but 1D, it's like 1d12 and|1d10, I believe. Uh, so we have a lot of|health. We have high constitution. And|once I press accept, we're going to have|even more of all that because I have|some elixir active and some um items|active that are just going to increase|my um health through the through the|roof. But action serve is going to|action serve, action surge is going to|give us an additional action to use as|well. So before we even get started on|items, I do want to talk about one|important thing, and it's elixir. If|you're comfortable with elixirs, you've|played the game plenty of times, this is|going to be just a refresher course. If|you're brand new to the game, it's|important to know that elixirs are|special potions that will last until|long rest and usually give you some|very, very strong effects. So, what|we're going to see here are four primary|elixirs that I like to play with with|this build. If you really want to go|hard in the paint and cheese your|strength and really just push that|modifier to the max, you'll want to use|the elixir of hill giant strength in the|beginning portions of act one. You'll be|able to find all the ingredients for|this by talking to any of the alchemist|characters in the game to get those|ingredients that then make those|potions. Eventually though, you'll be|able to craft the better version of|this, which is the elixir of cloud giant|strength. Increases a creature's|strength strength. Strength increases a|creature's strength. strength to 27.|This elixir can be thrown at a target to|apply its effects, of course, but it set|it to 27. It's the highest it can|natively be. It's super strong here,|right? Remember, we're going to be able|to double that and then double that|again because giants and all sorts of|fun stuff. So, that is really strong.|But if you don't want to focus on the|strength elixir cuz you're like, this is|just too cheesy. It it trivializes so|much of the game, even using something|like blood lust is very good. Once per|turn, when you kill a foe, you gain five|temp hit points and an additional|action. It's worth noting in honor mode|and I believe um the one right below|honor mode, this only occurs once, but|in the standard balanced and below, this|will occur infinitely in a in in a|round, I believe. So, you can just keep|killing things and keep having this|skill. But in honor mode, this will the|additional action only occurs once per|combat round. Then there's the elixir of|viciousness, which is going to increase|your critical hit chance. Well,|basically, it reduces it by one, right?|So rather than rolling a 20 to critical|hit, you can roll a 19 and a 20 with|this elixir quafted plus any of other um|critical hit bonuses that you can take|advantage of. So I wanted to talk about|elixir cuz they are a very big focus um|from the community and from just|minmaxing of this build, but I didn't|want you to think that you had to use|them if you don't want to. Now|unfortunately there's a lot of items for|this build I do not have. So let's go|through some of them here to show them|off. One of the first ones, most|important ones is the gloves of|belligerent skies that you can use|instead of the gloves that I'll be|showing which is the gloves of|uninhibited Kush the Kushiko set gloves.|So gloves of belligerent skies here when|the wearer deals thunder lightning|damage inflict two turns of reverb upon|the target. We would use this in|conjunction with the ring of spiteful|thunder. When the wearer deals thunder|damage to reverberating creature, it|becomes days unless it succeeds a|constitution saving throw. and this|thunder skin cloak. When a creature with|reverb deals damage to the wearer, the|creature needs to make a constitution|saving throw or become dazed. So, we|would stack this up as much as well with|the boots of stormy clamor. When the|wearer inflicts a condition upon a|hostile target, they also inflict two|turns of reverb reverb. So basically|hitting anything with thunder damage,|which we're going to get access to|freely at level six, just means, which|is roughly when you would get almost all|these items, means that you're almost|always going to trigger reverberation on|things, meaning you're going to knock|them prone, meaning you're going to|really just get all of your critical|hits on the target almost always. It's|really disgusting. It's a really, really|strong combination, and it fits the|theme of this build. It's why I've used|it. It's why I'm focusing on it. Another|ring I actually don't have is the ring|of flinging. The wearer deals 1d4 bonus|to throw damage. You get all this stuff|in act one. So you can you can your|character gets online extremely quickly|and they can just do damage throughout|the entirety of their turn. Another one|too that I don't have that also you get|in act one is the returning pike. Uh|this weapon will return to its owner|when thrown. You don't need to worry|about this after you get level six, but|it's a way that you can be a throwing|barb before getting level six basically.|So you don't need to really worry about|that. you can just use this because it|automatically will return to you and it|has the throne property again. You'll|get that in the very beginning in act|four in act one around level four. So|you can use your um tavern brawler|capability and the returning pike quite|quickly. Now another piece of armor too|that I don't have is the enraging heart|garb raging the wearer generates two|turns of wrath and you get plus two|constitution. You'll get this in the|beginning of act two. It's nice because|you're always going to enrage. It's|always going to give you two turns of|wrath, which means it increases your|damage by two, and it gives you two|constitution. So, it's a really nice one|that you can take advantage of. Um, but|it is one that I don't have that I do|want to talk about because a lot of the|stuff I'm going to show off is stuff|that is like either not going to be|useful until you get into act three when|you're going to swap into the bone spike|guard, which is really, really good. But|you can really use any armor as long as|it's not actual armor, right? Even the|blood guzzler guard, when an enemy|damages the wearer, the wearer gains|wrath for two turns. This is an act one|that you can use instead. So, there's|plenty of armor that is not well plenty|of cloth that is not armor. So, those|are the items that Oh, yeah. There's one|more thing. The haste helm. You get this|in the very beginning of the game in the|blighted village, and it can be useful|all the way up to act three if you wish.|At the start of combat, the wearer gains|momentum for three turns. That's a 15 ft|increase to your movement speed. And|since there's not a ton of helmets that|are really contested for this character,|you can use this the entire time and be|totally fine until you get the bone|spike uh helmet or the marksman hat. You|gain a plus one bonus to ranged attack|rolls and thrown attack roles. It's kind|of goofy, but you can also hide this hat|if you don't want to actually see it on|your character, but you'll get this in|act two, I believe, at the um at the|Moonrise Citadel. Moonrise. Nope.|Moonrise Towers. Um, so you can get that|on the character as well, just to do|more damage. Um, well, get your your|ranged attacks and thrown attacks online|easier. Attack rolls are not damaged.|So, uh, that those are the items I don't|have. Let's jump into the items I do|have. So, for our weapons, you have a|lot of options. You're pretty much going|to use whatever weapon you want as you|play through because you can just apply|throne to whatever you want after level|six, right? So, please, I encourage you|to try out new weapons that you would|otherwise not use for this build because|the throw barb has a set number of um|weapons that have been spouted out on|the internet for ages ever since the|build was really brought online. So, I|encourage you to play with a bunch of|them. So, what we have here is the|faithbreaker, which you can use the very|beginning of the game. Um, you'll get|this in the uh goblin camp, but you can|also have fun with stuff like the|draketh throat glaive where you can|imbue a draconic elemental weapon onto|stuff. Um, this used to give us a plus|one as well as also giving us elemental|weapon damage, but now it only gives us|the elemental weapon damage. The plus|one is baked into the item. Um, so this|makes you can't superficially buff up|items um, weapon enchantments. It kind|of sucks there. It's a minor nerf. Um,|but you can use this and then also add|your draconic um I'm sorry, not your|draconic glaive, your your special|barbarian glaive. This one. Aha, there|it is. Elemental cleaver. So, you can|use elemental cleaver on stuff to then|give it that that further capability of|even more thunder damage. Um, even if|you wanted to use the Balderon's giant|slayer, you could use Balderon's giant|slayer and also get giant form and get|the other fun stuff here. So, this|weapon grants you advantage on attack|rolls against large, huge, or gargantuan|creatures. On a hit, double the damage|from your strength modifier. So, a lot|of crazy stuff can be done with Baldon's|Giant Slayer. Near Luna is a really,|really good one. It's probably the best|in slot one for this build because it|has native thunder damage and then it|explodes with more thunder damage. You|also gain a plus foot 10-ft bonus to|movement speed and jump distance and|equipping this weapon gives you immunity|to f to falling damage. So, oh, also it|has a plus three weapon enchantment. And|you get these abilities here. Um, you|can use Zephyr Flash when enraged|because it's a weapon action, not a|spell. H, same thing here with, oh, I'm|sorry, Zephr break, you cannot because|it is a spell. So, um, those two things|you have to consider. This one you won't|be able to if you're enraged. This one|you can u, but enraging is a bonus|action. So, you can use this first and|then go enraged. So, just think about|those things and how you want to really|play with them. But, Zephr Flash you can|definitely take advantage of. And it|does thunder damage, so you can trigger|all the thunder effects on all the items|that we've talked about. so far. Um,|also another really good one that you|get pretty early, it's in act two, is|the corpse grinder. Uh, the cool thing|about this is it does the 1d4 thunder|damage, but it also has this really cool|effect to just slam the ground and then|do um more thunder damage. So, I just|really like that one. So, those are all|of your items. You can use pretty much|any weapon that you want in the game and|have a ton of fun with it. And I'm going|to show you how we can really play a lot|with that. Um, I for the range stuff, I|have the Hellfire engine crossbow on|here because it has lightning arrow|thematically for this build. Remember|though, you can't use this unless you|are if you're enraged. So, just just|know that before you want to equip this.|And you'll only get this in act three|depending upon when you do the specific|thing that gets you this. No spoilers.|And there's also though the dead shot,|which helps reduce your critical hits by|one. So rather than being 20, it's 19.|As I've said before, you use this with|the elixir of viciousness. Now you're|going to critical hit on an 18 or higher|which is really really fun. Now on to|our items or I guess our gear. So for|your helmet I'm using right now the hell|dusk helmet. You can see in magical and|ordinary darkness and you cannot be|blinded. The wearer has a plus two bonus|to saving throws against spells and they|can't land critical hits against them.|I'm sorry. Where's or attackers can't|land critical hits against them. You|also get imilating gaze which is a class|action not a class action lawsuit. Um|but this allows you to work. This will|work even if you are enraged. So, it's a|cool thing that you can do. A really|popular one though that you can use is|bone spike helmet. When you are enraged,|um creatures around you have to take a|wisdom saving throw or take psychic|damage and the target receives half|damage on a save and they get|intimidation plus two. Really, it's|dealer's choice here. I just really like|the hell dust helmet. I look I think it|looks really cool. Neither of these are|very Thoresque. I guess this is maybe|like a little closer, but it's just not|the coolest looking helmet in the game|in my opinion. The fistbreaker helm|though you can use early in the game. A|plus one bonus to spell save DC. You get|a plus one bonus to initiative rolls.|That haste helm I talked about. Um or|the marksman hat. Plenty of helmets that|you can use. It's really down to you.|For your cloak. If you want to go with|all the thunder damage stuff that we|talked about, just go with a thunderskin|cloak. It's perfect. When a creature|with reverb deals damage to the wearer,|the creature needs to make a|constitution saving throw or become|dazed. Other cloaks though, uh the cloak|of protection is always good because it|just gives you AC. Right. If I put this|on, you can see our AC is already at 20|because of our constitution and|everything. So, you have plenty of|benefits from that. Other ones though|are just simply the flesh melter cloak.|So, something does damage, it does acid|damage back. I love the cloak of|displacement because it just basically|casts blur on you at the beginning of|combat. It's a cool defensive one since|you're not really going to be up close|and personal. I guess for this video,|I'll put this on because I don't have|the thunder stuff. Now, for your armor,|in act two, you will get the mighty|cloth. You gain bull strength and|increase your strength score by two to a|max of 20. This is actually really|helpful because you won't get improved|ability score until level eight, right?|So, the mighty cloth will set your|strength to 20 until then. So, it's a|very, very convenient and fun thing to|use because take a look at this.|Remember, hill giant strength sets our|strength to 21. There is no difference|between 20 and 21 as far as our|additional ability points go. At 20,|it's the same number right here. This|plus right here as 21. So remember, it's|every two points that you get a plus one|to this uh check uh box. That's not the|right term, but I just my brain my|brain. Um also, you cannot be pushed|against your will and have an advantage|on saving throws against being|restrained. Bull strength through you|can just carry tons and tons of weight.|um advantage on strength checks and|carrying capacity is doubled. So it was|it was already increased by 1/4. Now|it's increased by double everything. So|it's really nice to be able to be able|to basically carry everything in the|game. You also get bull rush. It is a|class action. So you can use this while|enraged as well. But I definitely|recommend that until you get the bone|spike garb. You gain 15 10 hit points|when you rage and reduce all incoming|damage by two. When the wearer is struck|by a melee attack, the attacker takes|six piercing damage. It's just such a|good one. Now, as far as our glove slots|go, I like the gloves of uninhibited|Kushiggo. I thought it was not|uninhibited when I was talking earlier.|I was like, is it uninhibited yet? I|don't remember. But the wearer deals an|additional 1d4 damage with throw attacks|and attacks made with improvised|weapons. So, if you use this with the um|the ring of flinging, it's 1d4 plus an|additional 1d4 of damage. It's why you|stack those two together so much. But|other ones you can use here are stuff|like the flawed hell dust gloves for|fire damage here. um or the hell dust|gloves for even more fire damage. Plus,|I think rays of rays of fire is a|cantrip. Um so I do not believe you can|use it while|enraged. But there's also the bone spike|gloves. Your attacks ignore resistance|to slashing, piercing, and budgeoning|damage. So you can try to bypass that|entirely if you want. Now for our boots,|I like the bone spike boots here. Plus|one bonus to armor class and saving|throws. As long as you are not wearing|armor or holding a shield, your jump|distance is increased by 5t. And for me|that kind of simulates the Thor concept|of flying. Um, also your jump is|converted to a brutal leap, so it can|knock things prone in addition to all of|the reverb that knocks things prone. Of|course though, this would take the place|of your boots of stormy clamor. So|consider that. Both of these slots are|going to replace the thunder stuff. So|decide for yourself. Do you want to|focus on the throwing damage and like|kind of the mobility of these or the|thunder damage and the thunder concept|and reverberation? Thematically, thunder|is where we would go because this|build's called Thor, but min maxi, it's|up to you. Um, other boots though that|you can use, I actually really like the|Heldusk boots. You just get them so late|in the game. Um, they because they have|their hellcrawler ability here, you just|teleport and blow up into a big uh uh|explosion of fire, but you can't be|forcibly moved or by a fo's spells or|actions. You ignore the effects of|difficult terrain. Also too is the boots|of speed. Simple uh bead speed boots.|The early linereaker boots are quite|good. Once per turn when you dash, you|gain wrath. So that's two plus to your|damage, right? Uh disintegrating|nightstalkers. They're just misty step.|You can take advantage of those if you|so wish. Just kind of go with whatever|you'd like. Now, when it comes to our|amulet here, um one of the contested|slots here, or I guess one of the|contested items is always going to be|this one. The amulet of greater health|is really good because it sets your|constitution to 23. That's great because|remember that's how you get more armor|class. But you might not be using this|might be being used on another|character. So just consider that kind of|factor into it. Okay, do I want the|increased armor class on this character?|Let me just kind of factor this whole|situation out before I go into|it. Um just wanted to see something. Um|also too, you have the moon drop|pendant. So when the wearer has 50% hit|points or less, they don't provoke|opportunity attacks. Amulet of the|Harper's advantage on wisdom saving|throws. If you want, you can go with the|lightning blast stuff, which is the|there is a trident that you can throw|that does lightning damage. You get at|the very beginning of the game. There's|a number of lightning charged focused|items at the very beginning. They're|only in act one. And then you get|lightning blast here, which triggers all|them to blow things|up. Uh focus your veins to strengthen|your next lightning spell or can Oh, I'm|sorry. I thought that this would have|the ability to um blow up your lightning|charges that you could just do it|yourself. I'm sorry I misspoke there,|but you can go with all the lightning|stuff if you want. Just most of it is|unfortunately, as you saw, it's spell|themed, which is not how we're going|with this character. Another really nice|um item you can use is my treasure trove|of items over here that I did not put on|the character because, you know, why|make an actual comprehensive good video|when I can actually have a ramshackle|one is the Fay Semblance Amulet. You|have advantage on intelligence, wisdom,|and charisma saving throws. All three of|those stats you have quite low in this|character, so it gives you the chance to|save against them a little bit better.|It's a defensive amulet versus the|amulet of greater health is a defensive|amulet as well, but it just gives you|lots of health. Right, we have 159 on|this character right now. Then lastly,|for rings, we have access to the killer|sweetheart to help try to guarantee a|critical hit. Ring of regeneration just|for some healing, but you can go with|the crusher's ring. You can go with the|spurred band. You can go with|coruscation ring here. So when the|wearer deals spell damage while|illuminated by a light source, they're|inflicting radiating orb. You cannot use|this one. I got this confused with the|other one that does two additional|points of radiant damage. So do not use|this ring. That's for spell damage. Uh|you'd want to use the one that just does|a flat two um damage. Um a flat two acid|damage I believe it is. So I got those|two. The callus glow ring is the name of|it. Um, and also another amulet too is|the amulet of mist. Pretty much amulet|amulet thought is going to be a|defensive or utility choice for this|character. So, let's put all this|together and show off what the damage|can be like. Jumping into combat, let's|take a look at some things and have some|fun. Um, I'm going to show you what this|oops what this can look like using giant|form after this little portion. But I|want to show first off what a lot of|what this character can do using near|Luna or near. Um, first off, we've just|jumped into combat and I've quaed a|haste potion just to show off having|some additional actions where we can do|some stuff with that with. Uh, so what|we want to do here is first things first|is we want to use giant's rage. This is|going to enter a rage and increase our|size. So, we'll do|that. And we're going to immediately go|into elemental cleaver. This does not|require an action or a bonus action.|It's one of the best boons. It only|lasts for 10 turns, but we don't have to|worry about our action economy or it|being affected. Otherwise, it would not|make Elemental Cleaver as good because|you can only use elemental cleaver when|you're in enraged, and you can only|enrage when you're in combat. So, we|don't have to worry about that as much|here. So, we're going to go ahead and do|that. And we're just going to apply|thunder because we're focusing on as|much thunder damage with this build. So,|right now, this weapon here does 1d6|additional thunder.|Um 13 to 25 in total. uh you can use a|shield in the off hand, but it will shut|down some of your other items, so I|don't recommend it. So, what we want to|do here is throw. And we can do a lot of|different ways to approach throwing|because we're now a giant barb and we're|pretty large. Mighty Impel, you might|think a special type of thing that does|special damage. What I want you to think|of mighty Impel as, think of it in the|same way that Berserker or the Berserk|barbarian gets a bonus action of enraged|throw. Mighty impel is the same thing|only the throw that you're doing is|creature related. So we'll show that in|a bit here. But let's go ahead and press|throw and let's click on this one and|let's click right here. This one being|our our|weapon.|O little bit of splash damage there. Did|a little bit of damage. That's fine. So|we did 26 damage from the rage plus the|rage. Thunder damage plus the tavern|brawler plus more from the tavern|brawler. So you can see that there's a|ton of damage was just dished out here.|Um I I don't what what 34 37 uh plus an|addition. So 45 total damage right|there. Right. And we can go ahead and do|it again. I can even I'm going to throw|it right here. So it's in the middle of|all of them. There we go. Did a bunch of|damage right there. And it and it hit|for quite a bit as well. 26 4 8 and 7.|But you're a giant barb. And half the|fun of being a giant barb is suplex|throwing things into stuff because|that's the attack animation they chose|to go with. Let's go over here and throw|a human being right into another human|being. It's killed one and left this|one. Well, it was prone. Oh, there we|go. Prone. So, I mean, obviously, I'm|not going to I'm not going to attack it,|but I could go ahead now and throw at|it and just do a ton of damage to it. 25|4 8 9 Lots of damage was done. But wait,|we can use a thunder. We can thunder|action. We can use a a bonus action. I'm|sorry, action search. You get another|action and then walk over here and throw|another person into another|person. And with mighty impel, we're|just doing the same exact action, only|it's relegated strictly to throwing|people rather than throwing a weapon,|which berserk uh and rage throw does|here. So, we just trash this whole|entire group of people. I mean, this|person's left alive with a piddling or|middling 14 hit points, but you can see|how you can really get disgusting amount|of damage on board with this character|by just slashing your way through stuff|and I'm sorry, throwing your way through|stuff. So, that's half the fun here. So,|let's go ahead and end this turn and end|this turn and end this turn. We're going|to see some damage attempts on us.|That's okay. And we'll show I just want|to show Mighty Impel real quick. Uh,|just so that you can see that it doesn't|really do anything different|This person's going to make a throw on|me. You don't even know how. You don't|even know how the first thing of|throwing,|buddy. Just do a bunch of flicks here|and|there. And since we have so much|dexterity, we have the that ability um|as a barbarian to get plus three to our|initiative. We have a pretty decent|initiative. So, we're usually almost|always going first, if not second. Um in|this case, I don't know. I got unlucky.|I think our initiative is actually only|six, which is pretty low. Um, so we're|going to come back to Carlac and Carl's|going to have fun throwing someone into|a fence over here just to show you what|mighty Impel looks like. We can click|this. Now, we could also too use Boot of|the Giants and kick someone just so you|know it's it's there. But Mighty Impel,|we're going to throw this person. The|problem is that your Mighty Impel, it's|got a pretty limited throw range. That's|the important thing to know here. Uh,|versus I don't think throw can reach|either. Yeah, it can. It's just just|worth noting throw range of your actual|weapon, you could see, is going to reach|this person, but mighty impell just|picking up anyone is just going to have|a pretty limited throw range. We'll just|chuck this person real|quick. Throwing them into someone does|way more damage, which you can see 83|knocked them prone. Uh, if we go up here|to just throwing someone, which was|right around here, use throw on on fit|kipso.|uh hit uh yeah on fit kept on fist keo|fist Selena hit Fist Kepso for 11 then|eight then eight then eight then seven.|So that extra 11 came from the collision|of these two individuals. So they're|still pretty much the same damage. It's|just you're not in this instance we|didn't hit anyone. Usually mighty Impel|you'd want to hit someone. So let me|just jump real back. Let me kind of roll|this save and show you the giant|balderon slayer or baldon giant slayer|and how giant form works here too. So to|look at the giant balderon slayer, we|have a really cool ability here and that|is called giant form. Go to a fearsome|size weapons deal an additional oops 1d6|damage and you gain 27 temp hit|points. You just have to know though|that this is overwritten by your|enrage. So you can't stack this stuff|up. Um, you can't go giants enrage and|giant form. You can with any other|enrage, but specifically with giants|enrage, it will not work. Let's just|show that off really quick. So, we're|about to jump into combat. I'm going to|use giant's|form. What's funny is we're still going|to increase in size. But, we're at|Giants form. We're huge. We have 10|turns to use this. I'm going to use|speed potion just to We can do|that. Come back over here. Go into|combat.|Um, we'll wait here. We only got this|one person to do their little thingy|Okay. Yeah, I get it. We're all going to|do an in snaring strike. We're all going|to miss. Now, we're back to Mommy|Carlac. So, I need to go into Giants's|rage. Basically, you get the same stuff|here, right? You just can't stack them.|Look at my Look at my 10 pit points.|It's 27. Remember, you can only get 10|pit points from one source that is|currently active. And we have Giant's|here. She still increases in size, which|is funny, but Giant's rage overwrites|it. And our 10 hit points drop from 27|to 15. So, I just wanted to show that|off. If you do want to use the Boulder|and Giant Slayer, just don't rely on|Giant's form to be the thing that does|all the damage for you. You can still do|all the damage you want using the|Baldron's Giant Slayer just as it we did|before. my little trick. I mean, you can|do that just fine. Doesn't it doesn't|have the big boom explosion that we had|before, but just to show you it has that|capability as if if you wanted to use|it. Critical miss. Of course, in the|middle of a video, I would get a|critical miss. Why wouldn't I? We can do|all those things that we did before. We|can run over here and chuck this person|into that person without any problem.|So, the Balon Giant Slayer is, you know,|one of the best 200 weapons in the game,|but I wanted to show how you can't|really use its abilities to the best of|their ability, unless you wanted to go|ahead and just run up there with this|thing.|Like, you can still do top of the big|folk and have fun with that if you want,|but it's just knowing that giant form|and giant's rage don't stack. So, this|build's a lot of fun. It it takes the|throwing recipe and kind of turns it on|its head a little bit by focusing on you|throwing people by focusing on you using|mighty impel to really get the most out|of throwing people. And it's honestly|it's a ton of fun. I was really against|the whole notion of throwing people. I'm|like, man, I can just throw weapons and|it's so much cooler because now I can|make it so I can throw any weapon. I|honestly find that it's so fun to|disrupt the battlefield by throwing|things into each other and knocking them|out, making them lose concentration,|whatever it is. You'll find that the|amount of control that throwing people|gives you is actually far more|advantageous than sometimes just doing|outright damage. Of course, doing|outright damage and killing things is|great, but being able to have them prone|and then be lined up for an attack is|huge. Like, man, I just did 47 damage to|that. And this isn't even a character|that's focused in melee damage. So you|get my point here is knocking things|prone. That's what reverberation does.|That's what throwing things does. Allows|you to really open the door to lots of|damage for the rest of the party or even|the character that's throwing things. So|have fun with this build. A lot of|different ways you can approach it. Go|ahead and let me know if you've chosen|different routes, different items for|your builds in Balderskate 3. But as|always guys, thank you so much for|watching here today. Have a good one and|take care.